{
  "designations" : [
    {
      "title" : "Hashedin by Deloitte - Software Engineer II",
      "timeline" : "August 2022 - Feb 2025",
      "experiences" : [
        {
          "title" : "Grails to Spring Boot: A complete application re-write",
          "role" : "Backend Developer",
          "data" : [
          ]
        },
        {
          "title" : "Data Center Exit",
          "role" : "Backend Developer",
          "data" : [
            "Led the migration of an outdated legacy Java application and a Perl application from on-prem servers to AWS",
            "Integrated Gradle(with Groovy) from scratch to the outdated legacy Java application and led devops team on setting up CI/CD pipeline for it to support continous integration and deployment.",
            "Resolved critical issues, including the absence of a build system and sensitive information stored in plain text. Integrated Gradle and encrypted sensitive data in configuration files as per the organization standards, ensuring security and improved maintainability.",
            "Tech Stack: AWS, Gradle with Groovy, Java, Perl, Cryptography",
            "", 
            "Took a key role in investigating and resolving performance issues in an application that struggled under normal load after migrating to AWS. Conducted an in-depth analysis of internals of AWS Load Balancers and Tomcat to identify the root cause and implemented a successful fix.",
            "Migrated application from Oracle to PostgreSQL database, rewrote several Oracle queries to ensure compatibility with postgres.",
            "Tech Stack: AWS Application Load Balancers, Tomcat, Jmeter"
          ]
        },
        {
          "title" : "Legacy Application Rewrite in Spring Boot", 
          "role" : "Backend Developer and CUAS Application Expert",
          "data" : [
            "An application written in Groovy on Grails, faced many high-risk security vulnerabilities due to outdated libraries which could not have been updated to their vulnerability free version due to incompatibility with the applicatoin's Grails version. Being one of the application experts, I played a key role in planning its rewrite migration, architecture designing, and initial implementation and testing to ensure a secure and modernized solution.",
            "Played a key role in re-writing the application's security layer using the Spring Security framework by implementing custom filters, authentication providers, and integrating them with AuthenticationManager and finally testing.",
            "Tech Stack: Spring Boot, Spring Security, Gradle, Postgresql"
          ]
        },
        {
          "title" : "Audit Log Queries Optimization",
          "role" : "Backend Developer",
          "data" : [
            "Analyzed existing queries' SQL plan for Audit Log table and optimized them. After optimization the average response time reduced from 2 minutes to under a second.",
            "Tech Stack: Oracle, SQL"
          ]
        },
        {
          "title" : "Ciam Migration",
          "role" : "Backend Developer",
          "data" : [
            "We created a CIAM Migration tool ( a set of Spring Batch Jobs) to migrate users to a Customer Identity and Access Management (CIAM) system built on Auth0. The tool sets up user profiles on the CIAM platform with the necessary roles, enabling them to log in to our application through the SSO (Single Sign-On) process.",
            "Developed a small UI tool to help the Services team quickly identify the root cause of issues preventing users from accessing the application through the CIAM login flow",
            "Developed and implemented a plan to migrate users from Account Mapping and Account Linking login flows to the CIAM login flow and successfully migrating users in production environment",
            "Tech Stack: Spring Batch Framework, Spring Quartz Framework, Groovy on Grails, AngularJS"
          ]
        }
      ]
    },

    {
      "title" : "Hashedin by Deloitte - Software Engineer I",
      "timeline" : "July 2021 - August 2022",
      "experiences" : [
        {
          "title" : "Auth0 Integration with CUAS",
          "role" : "Full stack Developer",
          "data" : [
            "Led the integration of Auth0 into a legacy application with an AngularJS frontend application. Despite the lack of native support for the technology from Auth0, I developed a robust solution native to the code for integrating Auth0 into the application. Managed the entire process from architectural design to implementation single-handedly",
            "Created a custom authentication flow in the backend application written in Groovy on Grails using Spring Security Framework for authentication and authorization. The custom authentication flow lets users login from the idToken obtained from Auth0. ",
            "Created a new login flow which enabled customers to authenticate themselves through their own IDP servers through Auth0 while signing into our application. The solution enhanced the user experience and fulfilled the SSO requirements without requiring direct libraries from Auth0 for AngularJS or Grails.",
            "Tech Stack: AngularJS, Auth0 Service, Groovy on Grails, Maven",
            "", 
            "Worked on creating new Features and Rest APIs in a Java Servlet with JSP application"
          ]
        }
      ]
    },
    {
      "title" : "Hashedin by Deloitte - Software Engineer Intern",
      "timeline" : "Feb 2021 - June 2021",
      "experiences" : [
        {
          "title" : "Highlighter - Backend Developer",
          "role" : "Backend Developer",
          "data" : [
                "Developed the backend in Spring Boot from scratch for the Highlighter Project, a chrome extension application that lets users highlight text on websites and save it to a centralized location. Users can later revisit their highlights with advanced search features to quickly find specific text or return to the original website from the centralized platform",
                "We later uploaded the application to Chrome Store",
                "Designed and implemented an optimal solution for highlighting text on websites, addressing a dynamic tree problem in the website's DOM structure",
                "Tech Stack : Spring Boot, Spring Security, javascript, Postgresql"
          ],
          "links" : [
            {
              "href" : "https://drive.google.com/file/d/1n6wnNwRzyNHVL8Kj2pio5TDE9tO5v4ve/view?usp=sharing",
              "text" : "HBS Highlighter Demo"
            }
          ]
        },
        {
          "title" : "Mutual Funds Portfolio Analyzer",
          "role" : "Backend Developer",
          "data" : [
            "Designed and implemented backend for the Mutual Fund portfolio analyzer.",
            "Tech Stack: Spring Boot, Postgresql, MuleSoft"
          ],
          "links" : [
            {
              "href" : "https://drive.google.com/file/d/1EltLndKHq3FQsOHYxsJF90x6niuPPDIx/view?usp=sharing",
              "text" : "MFPA Demo"
            }
          ]
        }
      ]
    }
  ]
}
